Revit 2027 API
DisplacementPath.IsValidReference Method
 Does the specified pick represent an edge or a curve belonging to one of the displaced elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidReference(
	DisplacementElement displacementElement,
	Reference reference
)
Public Shared Function IsValidReference (
	displacementElement As DisplacementElement,
	reference As Reference
) As Boolean
public:
static bool IsValidReference(
	DisplacementElement^ displacementElement,
	Reference^ reference
)
static member IsValidReference :
        displacementElement : DisplacementElement *
        reference : Reference -> bool
Parameters
displacementElement DisplacementElement
 A DisplacementElement.
reference Reference
 A pick.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementPath Class
Autodesk.Revit.DB Namespace